from math import *

def print_(x):
    if type(x) == float:
        print("%.4f" % x)
    else:
        print(x)
# ********** Begin ********** #
#第一题
for (vin, rin, rout) in [(10, 10, 5), (10, 10, 10), (20, 20, 5), (20, 20, 10)]:
    #请在下面编写代码
    vout=vin*((rin/rout)**2)
    #请不要修改下面的代码
    print_(vout)

print('\n***********************\n')

#第二题
for (d, p, S) in [(7,300,10000),(7,400,15000),(10,400,12000),(15,400,12000)]:
    # 请在下面编写代码
    r=pow(d*p/(pi*S),1/3)
    # 请不要修改下面的代码
    print_(r)

print('\n***********************\n')

#第三题
for (P, N, r) in [(300000,10,6.5), (300000,20,6.5),(300000,30,6.5)]:
    # 请在下面编写代码
    payPerMonth=(P*r/1200*pow(1+r/1200,N*12))/(pow(1+r/1200,N*12)-1)
    # 请不要修改下面的代码
    print_(payPerMonth)


print('\n***********************\n')

#第四题

for (m,d,y) in [(1,1,2017), (2,14,2017), (5,1,2017), (6,1,2017),(7,1,2017),(12,25,2017)]:
    # 请在下面编写代码
    y0=y-(14-m)//12
    x=y0+y0//4-y0//100+y0//400
    m0=m+(14-m)//12*12-2
    d0=(d+x+31*m0//12)%7
    d0=int(d0)
    # 请不要修改下面的代码
    print_(d0)


print('\n***********************\n')

#第五题

for (x1,y1,x2,y2) in [(48.87,-2.33,37.8,-122.4),(40.89,116.50,37.8,-122.4),(40.89,116.50,48.87,-2.33)]:
    # 请在下面编写代码
    dist=degrees(acos(sin(radians(x1))*sin(radians(x2))+cos(radians(x1))*cos(radians(x2))*cos(radians(y1-y2))))*69.1105*1.609
    # 请不要修改下面的代码
    print_(dist)

print('\n***********************\n')

#第六题

for (t, v) in [(32,10), (32, 100), (40, 10), (40, 100)]:
    # 请在下面编写代码
    w=35.74+0.6215*t+(0.4275*t-35.75)*pow(v,0.16)
    # 请不要修改下面的代码
    print_(w)
# ********** End ********** #